tutorials/cases/posterDemo-woodColdBed/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           on;

chemistryType
{
    solver            ode;
}

solidChemistryType
{
    solver              solidOde;
    method              ODESolidHeterogeneousChemistryModel;
    solidThermoType     const<constRad<constThermo<constRho>>>;
}

initialChemicalTimeStep 1e-10;

turbulentReaction   off;
solidReactionEnergyFromEnthalpy false;
stoichiometricReactions false;
showRelativeReactionRates false;
solidChemistryTimeStepControl false;

diffusionLimitedReactions true;

odeCoeffs
{
    solver      seulex;
}

solidOdeCoeffs
{
    solver      RKCK45;
    absTol      1e-8;
    relTol      1e-6;
}

// Gas-phase species list (N2 + targas) with empty homogeneous reactions.
#include "reactions"

// Single lumped wood-pyrolysis reaction for the poster DEM-coupling demo.
//
// wood → 0.70 char + 0.30 targas   (mass fractions)
//
// The 70 % char yield gives a visible shrinking char core that contracts
// spheres to ~50 % radial fraction (volume ~12.5 % at constant density).
// The 30 % targas is a single lumped gas species replacing the full
// multi-species tar/CO/CO2/H2/H2O/CH4 set from updraftDemo.
//
// A = 2.0e4 sets the kinetic rate fast enough to give visible shrinkage
// over the 2 s demo, with diffusionLimitedReactions acting as a safety
// floor via harmonic mean.  k = A·exp(−Ta/T) = 20000·exp(−10) ≈ 0.91 /s
// at 800 K.  Starting from a uniform all-wood bed (Ywood=1, see
// setExprFieldsDict), Ywood(t) ≈ exp(−0.91·t):
//   t = 1.0 s: Ywood ≈ 0.40, Ychar ≈ 0.42, r ≈ 0.00206 (~31 % shrink)
//   t = 2.0 s: Ywood ≈ 0.16, Ychar ≈ 0.59, r ≈ 0.00168 (~44 % shrink)
// With the cold-start variant, the hot-gas inlet at the bottom heats the
// bed from below, so the reaction front — and the sphere-shrinkage
// gradient — moves bottom→top instead.
// Coefficient tuple: (A  Ta  Tcrit  deltaH  n)
//   A      pre-exponential factor          [1/s]
//   Ta     activation temperature E/R      [K]
//   Tcrit  no reaction below this T        [K]
//   deltaH heat of reaction (>0 endothermic) [J/kg]
//   n      reaction order in the solid
solidReactions
(
    irreversibleSolidArrheniusHeterogeneousReaction
    1.0 wood = 0.70 char + 0.30 targas
    (2.0e4 8000 300 -75000 1)
);

// ************************************************************************* //
